

/**
 * # ამოცანა 1 
 * 
 * შექმენით ფუნქცია რომელიც პარამეტრად მიიღებს ორ მასივს და დაგვიბრუნებს ამ მასივის საერთო წევრებს
 * მაგალითად: A = [1, 2, 3];  B = [2, 3, 4];   getCommonMembers(A, B) = [2, 3]
 * 
 */


/**
 * 
 * # ამოცანა 2 
 * 
 * დავუშვათ გვაქვს მასივი რომელიც გამოიყურება შემდეგნაირად: 
 * 
 * const obj = [
 *  {
 *    id: 1, 
 *    value: "raime",
 *    children: []
 *  },
 *  {
 *    id: 2, 
 *    value: "sxva ragac",
 *    children: [
 *       {
 *          id: 3,
 *          value: "kidev sxva ragac",
 *          children: []
 *       }
 *    ]
 *  }
 * ]
 *  
 * ანუ მასივის თითოეული წევრი არის ობიექტი რომელიც შედგება სამი property - სგან (id, value, childen)
 * children - ი შეიძლება იყოს ცარიელი, ან შეიცავდეს ზუსტად იგივე ტიპის ობიექტებს როგორიცაა მასივის ნებისმიერი წევრი 
 * 
 * ჩვენი მიზანია ამ დიდი obj ობიექტიდან ამოვკრიფოთ ყველა id - იები 
 * ანუ თუ ფუნქციას მივაწოდებდით მოცემულ obj - ს, ფუნქცია დააბრუნებდა [1, 2, 3] - ს
 * 
 * მინიშნება: 
 * - ამოცანა უნდა დაიწეროს რეკურსიულად 
 * - მასივის თითოეულ წევრს აქვს ხის სტრუქტურა
 */
